[
  {
  "file": "experiments/squares.js",
  "name": "Eye in cage of Squares",
  "description": "The eye reprisents envy and the squares changing color represent where you are and how envy follows you. For the coding part i used the square example and took away the noLoop because I wanted there to be constant movement along with this i changed the variance and stroke. I also used the CC complexity example and made it look like an eye by drawing more ellipses. To make the squares change colours i utilised the mouse hover logic we learned while making our games in year 1."
  },
  {
    "file": "experiments/squaresver1.js",
    "name": "Coding eyes",
    "description": "inspired by how my eyes feel after ive been coding for a long time using squares with a random stroke wigth as well as color and removing the no loop so they continuously change."
  },
  {
    "file": "experiments/squaresver2.js",
    "name": "Colorful squaareees",
    "description": "inspired by the colors in the elephant scene of a winnie the pooh film using squares with a slight variance and random stroke colors that change when the page is reloaded"
  },
  {
    "file": "experiments/flower.js",
    "name": "flowers tweaking out",
    "description": "inspired by amethysts in a minecraft cave i made some of the ellipses square and got kind of a shiny gem effecvt by randomising the colors of the shapes"
  },
  {
    "file": "experiments/flowerver1.js",
    "name": "Pond Lily",
    "description": "I tried to create a memory of mine from summer. We have a pond in our backyard surrounded by all these beautiful flowers and i was walking there one night and saw a single lilly growing in the middle of the pond. It was small but beautiful and resonated deeply with me. To create this i used the example of the noise dots from class and added some squares in various shades of blue to imitate that reflection of light on water as well as adjusting the sizes and framerate. on top this i used the flower example from class to try and imitate the little pink lily by adjusting the code according to my vision"
  },
  {
    "file": "experiments/flowerver2.js",
    "name": "barbified chess",
    "description": "We've been talking a lot about barbie in marketing so i wanted to create a barbie inspired chessboard pattern by tweeking the flower variables instead of just drawing squares"
  },
  {
    "file": "experiments/flow.js",
    "name": "One with nature",
    "description": "i was inspired by the way foliage grows on our old stone house. i utilised garrits flow field 03 and changed some values includeing the colours and stroke as well as the particles starting from the edges of the canvas instead of the particles starting in random places. along with this i simulated the stone wall by creating a grid of irregular squares"
  },
  {
    "file": "experiments/flowver1.js",
    "name": "Cherry blossom season",
    "description": "this variation was made to capture the feeling of taking a walk during cherry blossom season. with a green gate along the road and flower petals twirling in the air. This was made by combining the noise example from class and changing the size, color and opacity as well as adding additional rectangles. the petals were made using garrits flow field 03 example and changing the color and opacity as well as randomising the stroke width to get a fluttering effect.ß"
  },
   {
    "file": "experiments/flowerver1tone.js",
    "name": "Pond Lily With Tone.js",
    "description": "I was inspired by those speakers that show how sound waves make water move so in this case the higher the note the more waves(the noise) is shown. I made this by creating an array of my desired notes and connecting them to a slider. "
  }
]

